nekuneko/NeKuNeKo_SAMD_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Gontak SoK Zero Rev 4
# ---------------------------------------
sok_zero.name=SoK Zero (SAMD21J18A)
sok_zero.vid.0=0x1993
sok_zero.pid.0=0x0019
sok_zero.vid.1=0x1993
sok_zero.pid.1=0x0026
sok_zero.upload.tool=bossac
sok_zero.upload.protocol=sam-ba
sok_zero.upload.maximum_size=262144
sok_zero.upload.offset=0x2000
sok_zero.upload.use_1200bps_touch=true
sok_zero.upload.wait_for_upload_port=true
sok_zero.upload.native_usb=true
sok_zero.build.mcu=cortex-m0plus
sok_zero.build.f_cpu=48000000L
sok_zero.build.usb_product="SoK Zero"
sok_zero.build.usb_manufacturer="NeKuNeKo"
sok_zero.build.board=SAMD_SOK
sok_zero.build.core=arduino
sok_zero.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
sok_zero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sok_zero.build.openocdscript=openocd_scripts/sok_zero.cfg
sok_zero.build.variant=sok_zero
sok_zero.build.variant_system_lib=
sok_zero.build.vid=0x1993
sok_zero.build.pid=0x0019
sok_zero.bootloader.tool=openocd
sok_zero.bootloader.file=sok_zero/samd21_sam_ba_sok_zero.bin